// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int a = -7;
int b = 0;
int max = a;
if (a > max ) max = a;
else
{
    max = b;
}
Console.WriteLine(max);